Repository: collective/Products.PasswordStrength
Catalog: src/Products/PasswordStrength/locales/*/LC_MESSAGES/Products.PasswordStrength.po
Languages: es, fr

source: Add
es: Agregar
fr: Ajouter

source: A plugin that rejects passwords that don't conform to a certain strength
es: Un plugin que rechaza contraseñas que no estén conformen con cierto criterio
fr: Un plugin qui rejète les mots de passe non correspondant à une politique

source: Create your own rules for enforcing password strength
es: Cree su propia regla para forzar al uso de contraseñas fuertes
fr: Créer vos propres règles pour renforcer les mots de passe

source: Minimum 1 capital letter
es: Mínimo 1 letra capital.
fr: Au moins 1 lettre majuscule

source: Minimum 1 lower case letter
es: Mínimo 1 letra minúscula.
fr: Au moins 1 lettre minuscule

source: Minimum 1 non-alpha character
es: Mínimo 1 carácter no alfanumérico.
fr: Au moins 1 caractère spécial

source: Minimum 1 number
es: Mínimo 1 numero.
fr: Au moins 1 chiffre

source: Minimum 10 characters
es: Mínimo 10 caracteres.
fr: Au moins 10 caractères

source: PAS plugin that ensures strong passwords.
es: Plugin PAS que asegura tener contraseñas fuertes.
fr: Module PAS proposant une politique forte des mots de passes

source: Password Strength Plugin
es: Plugin para contraseñas fuertes
fr: Module Password Strength

source: This password doesn't match requirements for passwords
es: Esta contraseña no coinciden con los requerimientos para contraseñas
fr: Ce mot de passe ne respecte pas les contraintes indiquées

source: You must enter a password
es: Usted debe introducir una contraseña
fr: Veuillez saisir votre mot de passe

source: Your password and confirmation did not match. Please try again.
es: Su contraseña y su confirmación de contraseña no coinciden. Por favor, inténtelo de nuevo.
fr: Votre mot de passe et la confirmation ne correspondent pas. Veuillez réessayer
