Repository: collective/Products.PasswordStrength
Catalog: Products/PasswordStrength/locales/*/LC_MESSAGES/Products.PasswordStrength.po
Languages: de

source: Add
de: Hinzufügen

source: A plugin that rejects passwords that don't conform to a certain strength
de: Ein Plugin welches keine unsichere Passwörter zulässt.

source: Create your own rules for enforcing password strength
de: Erstelle deine eigenen Passwort regeln

source: Minimum 1 capital letter
de: Mindestens ein Grossbuchstabe

source: Minimum 1 lower case letter
de: Mindestens ein Kleinbuchstabe

source: Minimum 1 non-alpha character
de: Mindestens ein Sonderzeichen

source: Minimum 1 number
de: Mindestens eine Nummer

source: Minimum 10 characters
de: Mindestens 10 Zeichen

source: PAS plugin that ensures strong passwords.
de: Module PAS proposant une politique forte des mots de passes

source: Password Strength Plugin
de: Module Password Strength

source: This password doesn't match requirements for passwords
de: Dieses Passwort entspricht nicht den Passwort Vorgaben

source: You must enter a password
de: Sie müssen ein Passwort eingeben

source: Your password and confirmation did not match. Please try again.
de: Dein Passwort und deine Bestätigung stimmen nicht überein. Bitte versuch es nochmal.
